n3tk0/ESP32_Logger/node/src/main.cpp
// ============================================================================
// ESP32_Logger sensor node — ESP8266 satellite
//
// Reads the sensors its config lists and POSTs the values to an ESP32_Logger
// collector's /api/ingest. The config itself is docs/NODE_CONFIG.md §1: set
// on the node's own page (ConfigPortal.cpp), or by the collector in the reply
// to a POST (§3), which is also how the node follows the collector to a new
// network (§4) and finds it again when its address changes (§3.1).
//
// No storage beyond the config, no display, and — outside the setup page —
// no listening port except the background page on the LAN, and that only
// behind basic auth.
//
// Everything sensor-specific lives in node_common/NodeSensors.cpp (shared with
// the ESP-NOW node); every decision about the config and the link that can be
// made without a board lives in NodeSync.h, where tests/host reaches it.
//
// See README.md in this directory for wiring and setup.
// ============================================================================
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <ESP8266HTTPClient.h>
#include <WiFiClient.h>
#include <WiFiUdp.h>
#include <ArduinoJson.h>
#include <new>

#include "node_config.h"
#include "NodeLog.h"
#include "NodeStore.h"
#include "NodeSync.h"
#include "ConfigPortal.h"
#include "Backlog.h"
#include "node_common/NodeSensors.h"
#include "src/nodecfg/NodeConfigJson.h"
#include "NodeCfgTables.h"
#include "src/nodecfg/UdpDiscovery.h"
#include "src/nodecfg/UdpDiscoveryHmac.h"

using nodecfg::NodeConfig;
using NodeSync::Net;

static NodeConfig        s_cfg;
static SyncState         s_sync;
static NodeSync::Link    s_link;
static PortalLinkStatus  s_linkStatus;

static uint32_t s_lastPost   = 0;
static bool     s_postedOnce = false;

static bool     s_portalBgRunning = false;

/// §3: the full config goes with the first POST after boot (until one
/// carrying it is answered), and with every POST while `local`.
static bool     s_reportedSinceBoot = false;
/// The rev this node last refused — or rolled back. Never re-applied; see
/// NodeSync::decideReply().
static uint16_t s_rejectedRev = 0;
/// A config from the collector changed the network, the I2C pair or the
/// sensors: restart once this cycle's POSTs are done.
static bool     s_restartPending = false;

// ---------------------------------------------------------------------------
// Collector discovery (§3.1)
// ---------------------------------------------------------------------------

/// Broadcast the signed query and adopt whoever answers with a valid reply.
///
/// WHEN: right after this node moved to the collector's next network (§4.5),
/// and after three failed POSTs in a row. Both are "the address this node
/// has for the collector may be wrong"; nothing else is a reason to believe
/// a broadcast over the address the user typed.
///
/// The reply is tagged with the ingest token, so this adopts only a device
/// holding the same token — not whatever on the LAN answers first. The local
/// socket is bound to the discovery port itself, so a collector that replies
/// to the port rather than to the query's source port still reaches it.
static bool runDiscovery() {
    using namespace nodecfg::udpdisc;
    if (WiFi.status() != WL_CONNECTED) return false;

    uint8_t nonce[NONCE_LEN];
    ESP.random(nonce, sizeof(nonce));
    uint8_t query[QUERY_LEN];
    if (!buildQuery(query, nonce, s_cfg.name, s_cfg.net.token, udpdiscHmacSha256)) {
        LOGLN("[disc] cannot build a query (node name?)");
        return false;
    }

    WiFiUDP udp;
    if (!udp.begin(DISCOVERY_PORT)) {
        LOGLN("[disc] cannot open the UDP socket");
        return false;
    }

    bool found = false;
    IPAddress from;
    uint16_t port = 0;
    // Three tries, 700 ms each: a collector busy writing a log file answers
    // late, and a lost broadcast on a busy 2.4 GHz band is common.
    for (int attempt = 0; attempt < 3 && !found; attempt++) {
        // The subnet's broadcast AND the limited broadcast: some access points
        // drop one or the other between wireless clients.
        const IPAddress dests[2] = { WiFi.broadcastIP(), IPAddress(255, 255, 255, 255) };
        for (const IPAddress& d : dests) {
            udp.beginPacket(d, DISCOVERY_PORT);
            udp.write(query, sizeof(query));
            udp.endPacket();
        }
        const uint32_t t0 = millis();
        while (!found && millis() - t0 < 700) {
            const int len = udp.parsePacket();
            if (len <= 0) { delay(10); continue; }
            uint8_t buf[REPLY_LEN + 1];
            const int n = udp.read(buf, sizeof(buf));
            uint16_t p = 0;
            if (n > 0 && parseReply(buf, (size_t)n, nonce, s_cfg.net.token,
                                    udpdiscHmacSha256, p)) {
                from  = udp.remoteIP();
                port  = p;
                found = true;
            }
        }
    }
    udp.stop();

    if (!found) {
        LOGLN("[disc] no collector answered");
        return false;
    }

    char host[nodecfg::HOST_CAP];
    nodecfg::copyStr(host, sizeof(host), from.toString().c_str());
    if (strcmp(host, s_cfg.net.host) == 0 && port == s_cfg.net.port) {
        LOGF("[disc] collector confirmed at %s:%u\n", host, (unsigned)port);
        return true;
    }
    LOGF("[disc] collector found at %s:%u (was %s:%u)\n", host, (unsigned)port,
                  s_cfg.net.host, (unsigned)s_cfg.net.port);
    nodecfg::copyStr(s_cfg.net.host, sizeof(s_cfg.net.host), host);
    s_cfg.net.port = port;
    // §3.1: saved and marked local, so the collector learns the address it
    // has on this network from the next report.
    s_cfg.local = true;
    storeSave(s_cfg, !s_link.onTrial());
    return true;
}

// ---------------------------------------------------------------------------
// WiFi
// ---------------------------------------------------------------------------

static bool connectTo(const char* ssid, const char* pass) {
    WiFi.mode(WIFI_STA);
    WiFi.persistent(false);
    for (int attempt = 1; attempt <= 3; attempt++) {
        LOGF("[wifi] connecting to \"%s\" (attempt %d/3)", ssid, attempt);
        WiFi.begin(ssid, pass);

        const uint32_t start = millis();
        while (WiFi.status() != WL_CONNECTED) {
            if (millis() - start > WIFI_CONNECT_TIMEOUT_MS) {
                LOGLN(" timed out");
                break;
            }
            delay(250);
            Serial.print('.');
            yield();
        }
        if (WiFi.status() == WL_CONNECTED) {
            LOGF(" ok, %s\n", WiFi.localIP().toString().c_str());
            return true;
        }
        // Clean up before the next attempt.
        WiFi.disconnect();
        delay(1000);
    }
    WiFi.disconnect(true);
    return false;
}

