n3tk0/ESP32_Logger/node/src/main.cpp
/// Bring WiFi up: three attempts on this cycle's network — the configured
/// one, or the collector's next one once the configured one has failed two
/// cycles running (§4.5) — then the setup portal for PORTAL_TIMEOUT_MS.
static bool ensureWifi() {
    if (WiFi.status() == WL_CONNECTED) {
        // Only flag it as running if it actually started: portalStartBackground()
        // refuses without basic-auth credentials, and setting the flag anyway
        // would have loop() calling portalHandleClient() on a server that was
        // never begun.
        if (!s_portalBgRunning) s_portalBgRunning = portalStartBackground(s_cfg);
        return true;
    }

    const bool hasNext = s_cfg.net.next.ssid[0] != '\0';
    const Net  which   = s_link.networkToTry(hasNext);
    const bool next    = (which == Net::Next);
    if (next) LOGF("[wifi] \"%s\" failed %u cycles; trying the next network\n",
                            s_cfg.net.ssid, (unsigned)s_link.wifiFails());

    if (connectTo(next ? s_cfg.net.next.ssid : s_cfg.net.ssid,
                  next ? s_cfg.net.next.pass : s_cfg.net.pass)) {
        const uint8_t a = s_link.wifiResult(true, which);
        if (a & NodeSync::LA_PROMOTE) {
            // §4.5: the new network is now this node's network; the old one is
            // kept as next, so a cancelled switch is survivable.
            NodeSync::promoteNext(s_cfg);
            storeSave(s_cfg, !s_link.onTrial());
            LOGF("[wifi] moved to \"%s\" (\"%s\" kept as next)\n",
                          s_cfg.net.ssid, s_cfg.net.next.ssid);
        }
        if (a & NodeSync::LA_DISCOVER) runDiscovery();
        if (!s_portalBgRunning) s_portalBgRunning = portalStartBackground(s_cfg);
        return true;
    }
    s_link.wifiResult(false, which);

    LOGLN("[wifi] repeated failures — opening setup portal");
    s_portalBgRunning = false; // portalRun will stop the HTTP server on exit
    if (portalRun(s_cfg, PORTAL_TIMEOUT_MS)) {
        LOGLN("[cfg] saved, restarting");
        delay(200);
        ESP.restart();
    }
    // Portal timed out. Return false so the loop can carry on recording.
    return false;
}

// ---------------------------------------------------------------------------
// The backlog
// ---------------------------------------------------------------------------
//
// WHY A NODE THAT CANNOT REACH THE COLLECTOR KEEPS ITS READINGS
//
// It used to read its sensor, fail to POST, print a line and throw the values
// away. A router reboot at 2 am was therefore a hole in the record that
// nothing could fill afterwards: the measurements had existed, briefly, in a
// stack frame. The collector has had a queue for exactly this since the
// ESP-NOW path was written (RemoteIngest::putHistorical) — the HTTP node just
// had nothing to hand it.
//
// A FLAT RING OF READINGS, NOT OF SAMPLES. Grouping by moment would mean
// sizing every slot for NODE_MAX_READINGS whether a node reports three metrics
// or eight, and paying for the eight on the node that reports three. The
// collector treats each reading independently anyway — each one carries its
// own age — so there is nothing for the grouping to buy.
//
// Each entry remembers millis() rather than a date. This node has no clock:
// what it can always say honestly is how long ago, which is what `dt_s` on the
// wire means and what the collector turns back into a timestamp using its own
// NTP-set clock. The same field, meaning the same thing, as EnvSample::dt_s in
// the ESP-NOW protocol.
//
// The ring itself lives in Backlog.h, where a host test can reach it: the
// arithmetic that wraps an index, drops the right end and survives the
// millis() rollover is exactly the part that is wrong quietly. It holds a
// pointer to each metric name; the names live in s_names for the life of the
// process (NodeSync::NameTable says why).

// How many go in one POST. The collector's body cap is 4 KB and a reading is
// roughly sixty bytes of JSON, so this leaves room for long metric names, the
// envelope and the config report rather than discovering the ceiling as a 413.
static constexpr int NODE_BATCH_READINGS = 48;

// The largest body this node will send. Deliberately below the collector's own
// 4096-byte cap rather than equal to it: the two numbers live in different
// firmwares that are not upgraded together, and the margin is what lets an
// older collector keep taking batches from a newer node.
static constexpr size_t NODE_MAX_BODY = 3800;

// How many batches one cycle may send. A node coming back from an outage
// should catch up faster than it accumulates, but not turn a reconnection into
// a burst that the collector's rate limiter reads as a flood.
static constexpr int NODE_BATCHES_PER_CYCLE = 4;

static NodeBacklog::Ring   s_backlog;
static NodeSync::NameTable s_names;

// ---------------------------------------------------------------------------
// The config the collector sends (§3)
// ---------------------------------------------------------------------------

static void rejectConfig(uint16_t rev, const char* field, const char* reason) {
    LOGF("[cfg] refused rev %u: %s: %s\n", (unsigned)rev, field, reason);
    s_rejectedRev = rev;
    s_sync.err.set(rev, field, reason);
    syncSave(s_sync);
}

/// What applying a collector config needs besides the running one: the
/// candidate and the validator's answer, ~1.5 KB, on the heap for the length
/// of the call rather than on the 4 KB loop stack.
struct ApplyWork {
    NodeConfig          cfg;
    nodecfg::Validation v;
    nodecfg::Issue      issue;
};

/// validate → back up → save → apply live, or restart when the network, the
/// I2C pair or the sensor list changed.
static void applyCollectorConfig(JsonVariantConst doc, uint16_t rev) {
    ApplyWork* w = new (std::nothrow) ApplyWork();
    if (!w) {
        LOGLN("[cfg] out of memory for the collector's config; next cycle");
        return;
    }
    w->cfg = s_cfg;
    // NCJ_DEC_REV: this config says which rev it is. Secrets arrive in full
    // here (the one place they travel, §0.5); "" still means keep.
    if (!nodecfg::decodeConfig(doc, w->cfg, nodecfg::NCJ_DEC_REV, &w->issue)) {
        rejectConfig(rev, w->issue.field, w->issue.reason);
        delete w;
        return;
    }
    w->cfg.rev   = rev;
    w->cfg.local = false;   // the collector's config, not an edit on this node

    nodeValidate(w->cfg, w->v);
    if (!w->v.ok) {
        rejectConfig(rev, w->v.error.field, w->v.error.reason);
        delete w;
        return;
    }

