n3tk0/ESP32_Logger/node/src/main.cpp
    const uint8_t change = NodeSync::classifyChange(s_cfg, w->cfg);
    if (!storeSave(w->cfg, !s_link.onTrial())) {
        // Not refused — the config is fine, the flash is not. Nothing is
        // reported, so the collector keeps offering it and the next cycle
        // tries again.
        LOGLN("[cfg] could not save the collector's config");
        delete w;
        return;
    }
    if (change & NodeSync::CH_NET_TRIAL) {
        // §4.7: this config decides whether the node can reach anything. Run
        // it on trial; the backup taken just now is what a rollback restores.
        s_sync.trialRev = rev;
        syncSave(s_sync);
    }
    s_cfg = w->cfg;
    delete w;

    LOGF("[cfg] applied rev %u from the collector%s\n", (unsigned)rev,
                  (change & NodeSync::CH_RESTART) ? "; restarting after this cycle" : "");
    if (change & NodeSync::CH_RESTART) s_restartPending = true;
    // Everything else (name, interval, altitude, board, net.next) is read
    // from s_cfg where it is used, so it is already live.
}

static void handleReplyCfg(JsonVariantConst c) {
    NodeSync::ReplyCfg r;
    r.present = c.is<JsonObjectConst>();
    if (r.present) {
        JsonObjectConst o = c.as<JsonObjectConst>();
        r.rev = o["rev"] | 0;
        bool other = false;
        for (JsonPairConst kv : o) {
            if (strcmp(kv.key().c_str(), "rev") != 0 &&
                strcmp(kv.key().c_str(), "local") != 0) { other = true; break; }
        }
        r.revOnly = !other;
    }

    switch (NodeSync::decideReply(r, s_cfg.rev, s_cfg.local, s_rejectedRev)) {
        case NodeSync::ReplyAction::Confirm:
            // §3: "your local config is now rev N". Same content, so no backup:
            // /config.prev.json keeps the config from before the last change.
            LOGF("[cfg] collector adopted the local config as rev %u\n",
                          (unsigned)r.rev);
            s_cfg.rev   = r.rev;
            s_cfg.local = false;
            storeSave(s_cfg, false);
            break;
        case NodeSync::ReplyAction::Apply:
            applyCollectorConfig(c, r.rev);
            break;
        case NodeSync::ReplyAction::Ignore:
        case NodeSync::ReplyAction::None:
            break;
    }
}

// ---------------------------------------------------------------------------
// Post
// ---------------------------------------------------------------------------

enum class PostResult : uint8_t {
    Delivered,   ///< 200, and the collector took the whole batch
    Held,        ///< 200, but it took less than all of it: its queue is full
    Failed,      ///< no answer, or not a 200
};

/// Send up to NODE_BATCH_READINGS from the front of the backlog — or, with
/// nothing queued, none: a POST with an empty `readings` still reports the
/// config and still collects the reply's, so a node whose every sensor is
/// missing can be fixed from the collector.
///
/// Delivered only when the collector took the WHOLE batch — which is not the
/// same as "the POST returned 200", and the difference is the point. The
/// collector answers with how many readings from the front of the batch it
/// consumed; whatever it had no room for is still here and is offered again
/// next cycle. Dropping the batch on the strength of the status line is how an
/// outage at the collector becomes a hole in the record on the node.
static PostResult postBatch() {
    const int want = (s_backlog.count() < NODE_BATCH_READINGS) ? s_backlog.count()
                                                               : NODE_BATCH_READINGS;
    const uint32_t nowMs = millis();

    const bool withCfg = NodeSync::shouldSendCfg(s_cfg.local, s_reportedSinceBoot);
    const uint16_t errRev = s_sync.err.rev;

    String body;
    int n = 0;
    {
        JsonDocument doc;
        doc["node"] = (const char*)s_cfg.name;
        // Still 0: this node has no clock, so the collector stamps the batch
        // with its own and subtracts each reading's age from it.
        doc["ts"] = 0;

        // §3. cfg_rev always; the config itself without secrets; a refusal
        // until it has been delivered once.
        doc["cfg_rev"] = s_cfg.rev;
        if (withCfg) nodecfg::encodeConfig(s_cfg, doc["cfg"].to<JsonObject>(), 0);
        if (s_sync.err.pending()) {
            JsonObject e = doc["cfg_error"].to<JsonObject>();
            e["rev"]    = s_sync.err.rev;
            e["field"]  = (const char*)s_sync.err.field;
            e["reason"] = (const char*)s_sync.err.reason;
        }

        JsonArray readings = doc["readings"].to<JsonArray>();
        for (int i = 0; i < want; i++) {
            const NodeBacklog::Entry& p = s_backlog.at(i);
            JsonObject o = readings.add<JsonObject>();
            o["metric"] = p.metric;
            o["value"]  = p.value;
            o["unit"]   = p.unit;
            const uint32_t age = NodeBacklog::ageSeconds(nowMs, p.ms);
            if (age > 0) o["dt_s"] = age;
        }

        // TRIMMED TO FIT, BECAUSE A 413 HERE WOULD DEADLOCK THE QUEUE.
        //
        // The collector refuses a body over INGEST_MAX_BODY (4 KB) with a 413,
        // and 413 holds the batch — correctly, since a refused POST must not
        // cost readings. But a batch that is too big is refused again next
        // cycle and every cycle after: the queue never empties, and the node
        // quietly stops recording anything new the moment it fills. Forty-
        // eight readings reach ~3.6 KB only with the longest names, and the
        // config report adds up to ~1 KB on the first POST after boot — so
        // this loop does run then, and costs that one POST a few readings,
        // which the next one carries.
        while (readings.size() > 1 && measureJson(doc) > NODE_MAX_BODY) {
            readings.remove(readings.size() - 1);
        }
        n = (int)readings.size();
        if (doc.overflowed()) {
            LOGLN("[post] out of memory building the batch");
            return PostResult::Failed;
        }
        serializeJson(doc, body);
    }

    WiFiClient  client;
    HTTPClient  http;
    char url[96];
    snprintf(url, sizeof(url), "http://%s:%u/api/ingest",
             s_cfg.net.host, (unsigned)s_cfg.net.port);

    s_linkStatus.attempted = true;
    if (!http.begin(client, url)) {
        LOGLN("[post] http.begin failed");
        s_linkStatus.lastOk = false;
        return PostResult::Failed;
    }
    http.setTimeout(5000);
    http.addHeader("Content-Type", "application/json");
    http.addHeader("X-Ingest-Token", s_cfg.net.token);
    if (s_cfg.net.basic_user[0] != '\0') {
        http.setAuthorization(s_cfg.net.basic_user, s_cfg.net.basic_pass);
    }

