n3tk0/ESP32_Logger/node/src/main.cpp
    const int code = http.POST(body);
    body = String();   // the request is gone; give its ~3.8 KB back before the reply
    const String reply = (code > 0) ? http.getString() : String();
    http.end();

    if (code != 200) {
        // No answer, or one that is not this endpoint's. Keep everything: this
        // is the case the queue exists for.
        if (code > 0) LOGF("[post] %d (%d held)\n", code, s_backlog.count());
        else LOGF("[post] %s (%d held)\n",
                           http.errorToString(code).c_str(), s_backlog.count());
        s_linkStatus.lastOk = false;
        const uint8_t a = s_link.postResult(false);
        if (a & NodeSync::LA_DISCOVER) runDiscovery();
        return PostResult::Failed;
    }

    s_linkStatus.lastOk   = true;
    s_linkStatus.everOk   = true;
    s_linkStatus.lastOkMs = millis();
    if (s_link.postResult(true) & NodeSync::LA_TRIAL_OK) {
        LOGLN("[cfg] the new network settings reached the collector; kept");
        s_sync.trialRev = 0;
        syncSave(s_sync);
    }
    // Delivered with this POST: the report and the refusal.
    if (withCfg) s_reportedSinceBoot = true;
    if (errRev && s_sync.err.rev == errRev) {
        s_sync.err.clear();
        syncSave(s_sync);
    }

    // ── What the collector says it did, and what this node does about it ────
    //
    // `accepted` is the length of the PREFIX of the batch the collector
    // consumed. It is not the same as "how many it liked": a reading it threw
    // out as unusable is still consumed, because re-sending it would fail the
    // same way for ever. What is NOT consumed is whatever it had no room for —
    // its history queue is 64 readings and this node offers 192 — and those
    // are still here, in order, to offer again when it has drained some.
    //
    // A collector that predates this field answers without it. Defaulting to
    // `n` is what makes that upgrade path work: an older collector took the
    // batch through the live mailbox and re-sending would only overwrite it,
    // so the whole batch counts as delivered.
    //
    // THE REPLY CAN CARRY A WHOLE CONFIG (§3), secrets included — up to ~2 KB
    // of JSON. ArduinoJson 7's document grows as it parses, so there is no
    // fixed buffer to outgrow; what bounds it is the heap, and the request
    // body has already been released above to make room.
    int accepted = n;
    int room     = -1;
    {
        JsonDocument res;
        if (deserializeJson(res, reply) == DeserializationError::Ok) {
            accepted = res["accepted"] | n;
            room     = res["room"]     | -1;
            handleReplyCfg(res["cfg"]);
        } else {
            // 200 with a body this node cannot read: something in the way
            // answering for the collector, or an out-of-memory parse. The
            // status line is all there is to go on, and a node that never
            // empties its queue stops being able to record anything new.
            LOGF("[post] %d readings -> 200, unreadable reply\n", n);
        }
    }

    if (n == 0) return PostResult::Delivered;   // a report with nothing queued

    if (accepted < 0) accepted = 0;
    if (accepted > n) accepted = n;

    if (accepted == 0) {
        // Up, reachable, and taking nothing: its queue is full and needs a
        // sensor tick or two to drain. Everything stays here.
        //
        // THERE IS NO ATTEMPT LIMIT AND NO GIVING UP, deliberately. If the
        // collector never drains — no remote sensor configured for this node,
        // say — the ring shedding its own oldest entry is already the right
        // answer, and it goes on recording throughout. A node that threw a
        // batch away to unstick itself would be discarding readings to solve a
        // problem at the other end.
        LOGF("[post] collector took 0 of %d (room %d, %d held)\n",
                      n, room, s_backlog.count());
        return PostResult::Held;
    }

    s_backlog.drop(accepted);

    if (accepted < n) {
        LOGF("[post] %d of %d taken (room %d, %d held)\n",
                      accepted, n, room, s_backlog.count());
        return PostResult::Held;    // it is full; the next batch would only be refused
    }

    LOGF("[post] %d readings taken (%d still held)\n",
                  accepted, s_backlog.count());
    return PostResult::Delivered;
}

/// Read the sensors and remember what they said. NEEDS NO NETWORK, and that
/// is the point: the cycle where the link is down is the cycle whose readings
/// the queue exists to keep.
static void collectReading() {
    NodeReading vals[NODE_MAX_READINGS];
    const int n = nodeSensorsRead(s_cfg, vals, NODE_MAX_READINGS);
    if (n == 0) {
        LOGLN("[sensor] nothing to record this cycle");
        return;
    }
    const uint32_t ms = millis();
    for (int i = 0; i < n; i++) {
        const char* name = s_names.intern(vals[i].name);
        if (!name) {
            LOGF("[sensor] no room to name \"%s\"; dropped\n", vals[i].name);
            continue;
        }
        s_backlog.push(NodeBacklog::Entry{ms, vals[i].value, name, vals[i].unit});
    }
}

/// Hand over as much of the backlog as the collector will take. Returns true
/// when any POST this cycle was answered — the collector is there.
///
/// THE NEW READING GOES THROUGH THE SAME QUEUE as everything else rather than
/// down a separate live path. One route means one set of rules: it is sent
/// with an age of zero when the link is up, and it is still there — with an
/// honest age — when the link was down.
static bool flushBacklog(int maxBatches) {
    // Nothing queued still gets one POST: the config exchange rides on it.
    if (s_backlog.count() == 0) return postBatch() != PostResult::Failed;

    // Several batches, so a node coming back from an outage catches up faster
    // than it accumulates — but a bounded number, so a reconnection is not a
    // burst the collector's rate limiter reads as a flood. Stops at the first
    // batch that does not leave the queue: whatever refused one will refuse
    // the next, and the point is to wait, not to hammer.
    bool answered = false;
    for (int b = 0; b < maxBatches && s_backlog.count() > 0; b++) {
        const PostResult r = postBatch();
        if (r != PostResult::Failed) answered = true;
        if (r != PostResult::Delivered) break;
        yield();
    }
    return answered;
}

/// §4.7: the network settings the collector sent reached nothing for five
/// cycles. Put the previous config back, tell the collector why on the first
/// POST that gets through, and restart on the old settings.
static void rollBack() {
    const uint16_t rev = s_sync.trialRev;
    s_sync.trialRev = 0;
    if (!storeRollback()) {
        LOGLN("[cfg] no collector on the new settings, and no backup to "
                       "return to; keeping them");
        syncSave(s_sync);
        return;
    }
    s_sync.err.set(rev, NodeSync::ROLLBACK_FIELD, NodeSync::ROLLBACK_REASON);
    syncSave(s_sync);
    LOGF("[cfg] rev %u rolled back: no collector on the new settings; restarting\n",
                  (unsigned)rev);
    delay(200);
    ESP.restart();
}

static void restartForConfig() {
    // The backlog is RAM and does not survive the restart, so hand over what
    // the collector will take first — it has just answered, so it is there.
    // Bounded: a collector with a full queue takes nothing, and the new config
    // is not worth waiting indefinitely for.
    if (s_backlog.count() > 0) flushBacklog(8);
    if (s_backlog.count() > 0)
        LOGF("[cfg] restarting with %d readings not delivered\n", s_backlog.count());
    LOGLN("[cfg] restarting to apply the collector's config");
    delay(200);
    ESP.restart();
}

// ---------------------------------------------------------------------------
void setup() {
    Serial.begin(115200);
    delay(200);
    LOGLN("\n\nESP32_Logger sensor node " NODE_FW_VERSION);

    // Read the button before anything else claims GPIO0.
    const bool forcePortal = portalButtonHeld();

    storeLoad(s_cfg);
    syncLoad(s_sync);
    if (s_sync.trialRev) {
        LOGF("[cfg] rev %u's network settings are on trial\n",
                      (unsigned)s_sync.trialRev);
        s_link.beginTrial();
    }
    // A refusal (or rollback) not yet reported is also one not to take again
    // if the collector offers it before it has heard.
    if (s_sync.err.pending()) s_rejectedRev = s_sync.err.rev;
    portalSetLinkStatus(&s_linkStatus);

    {
        // Said at boot, not enforced: a config migrated from the old format
        // runs even if today's rules would refuse it (a node name with a dot
        // in it, say), because refusing would orphan its history on the
        // collector. The page shows the same complaint when it is saved.
        nodecfg::Validation* v = new (std::nothrow) nodecfg::Validation();
        if (v) {
            nodeValidate(s_cfg, *v);
            if (!v->ok) LOGF("[cfg] warning: %s: %s\n", v->error.field, v->error.reason);
            delete v;
        }
    }

    // Two reasons to run the portal with no timeout: there is nothing to fall
    // back to, or the user explicitly asked by holding FLASH through reset.
    // Both mean "wait for a human", so waiting indefinitely is correct.
    if (forcePortal || !storeIsComplete(s_cfg)) {
        if (forcePortal) LOGLN("[portal] FLASH held at boot");
        else             LOGLN("[portal] no usable config");
        if (portalRun(s_cfg, 0)) {
            delay(200);
            ESP.restart();
        }
    }

    LOGF("node \"%s\" -> %s:%u every %u s (rev %u%s)\n",
                  s_cfg.name, s_cfg.net.host, (unsigned)s_cfg.net.port,
                  (unsigned)s_cfg.interval_s, (unsigned)s_cfg.rev,
                  s_cfg.local ? ", local" : "");

    nodeSensorsBegin(s_cfg);
    LOGF("sensors: %s\n", nodeSensorsDescribe());
    ensureWifi();
}

void loop() {
    if (s_portalBgRunning) {
        portalHandleClient();
    }

