n3tk0/ESP32_Logger/node/src/main.cpp
    const uint32_t now = millis();

    // Unsigned subtraction, so the ~49-day millis() wrap is a non-event.
    if (s_postedOnce && (now - s_lastPost) < (uint32_t)s_cfg.interval_s * 1000UL) {
        delay(50);
        return;
    }
    s_lastPost   = now;
    s_postedOnce = true;

    // THE SENSOR PROBE FIRST, THEN THE NETWORK, AND NEITHER GATES THE OTHER.
    //
    // Both orderings have been wrong here. With the WiFi check first, a node
    // that cannot reach its router never re-probes its sensor — ensureWifi()
    // spends three connect timeouts and can block in the portal, then returns
    // false, every cycle forever, and a power cut that took out both the
    // router and a cold breakout leaves the sensor unfound until someone
    // walks to it. With the sensor check first (as it once shipped), a node
    // whose sensor was missing returned before ever reaching ensureWifi(), so
    // it never reconnected after a router reboot — and the background page,
    // the one way to fix the wiring without a cable, is started from in there.
    //
    // The probe needs no network and costs a few milliseconds, so it goes
    // first and unconditionally; the network follows and is likewise not
    // conditional on the sensor.
    if (!nodeSensorsReady()) nodeSensorsBegin(s_cfg);

    // MEASURED AND REMEMBERED BEFORE THE NETWORK IS EVEN LOOKED AT. The one
    // thing the backlog exists for — the cycle where the router is down — must
    // not be the one cycle whose reading was never taken.
    if (nodeSensorsReady()) collectReading();

    if (ensureWifi()) flushBacklog(NODE_BATCHES_PER_CYCLE);

    if (s_link.cycleEnd() & NodeSync::LA_ROLLBACK) rollBack();
    if (s_restartPending) restartForConfig();
}
